/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: srafe <srafe@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/11/22 17:57:54 by srafe             #+#    #+#             */
/*   Updated: 2018/11/22 18:03:27 by srafe            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_libft.h"
#include <stdio.h>  // Для printf
#include <string.h> // Для strlen

int		ft_strlen(char *str)
{
	int	i;

	i = 0;
	while(str[i] !='\0')
		i++;
	return (i);
}
